In [1]:
# Creating two dataframe
import pandas as pd
df1=pd.DataFrame({'A':[10],
                  'B':[20],
                  'C':[30]
                 
                 
                 })
print(df1)

df2=pd.DataFrame({'D':[40,12],
                  'E':[50,22],
                  'C':[30,33]
                 
                 })  # two columns
print(df2)

    A   B   C
0  10  20  30
    D   E   C
0  40  50  30
1  12  22  33

In [2]:
#concatinating two dataframes, notice the output, where one element of column C is common
n_df=pd.concat([df1,df2])
n_df

      A     B   C     D     E
0  10.0  20.0  30   NaN   NaN
0   NaN   NaN  30  40.0  50.0
1   NaN   NaN  33  12.0  22.0

In [3]:
_weather=pd.DataFrame({
    'city':['Dhaka','Rajshahi','Rangpur'],
    'temperature':[10,20,30]
})
_weather

       city  temperature
0     Dhaka           10
1  Rajshahi           20
2   Rangpur           30

In [4]:
Rangpur_weather=pd.DataFrame({
    'city':['Gaibandha','Lalmonihat','Kurigram'],
    'temperature':[40,50,50]
})
Rangpur_weather

         city  temperature
0   Gaibandha           40
1  Lalmonihat           50
2    Kurigram           50

In [5]:
n_df=pd.concat([_weather,Rangpur_weather])
n_df

         city  temperature
0       Dhaka           10
1    Rajshahi           20
2     Rangpur           30
0   Gaibandha           40
1  Lalmonihat           50
2    Kurigram           50

In [6]:
n_df=pd.concat([_weather,Rangpur_weather],ignore_index=True) # index is same as previous cell
n_df

         city  temperature
0       Dhaka           10
1    Rajshahi           20
2     Rangpur           30
3   Gaibandha           40
4  Lalmonihat           50
5    Kurigram           50

In [7]:
n_df=pd.concat([_weather,Rangpur_weather],keys=['_weather','Rangpur_weather']) #creating indexes while concatinating
n_df

                         city  temperature
_weather        0       Dhaka           10
                1    Rajshahi           20
                2     Rangpur           30
Rangpur_weather 0   Gaibandha           40
                1  Lalmonihat           50
                2    Kurigram           50

In [8]:
n_df=pd.concat([_weather,Rangpur_weather],
               keys=['_weather','Rangpur_weather'],names=['Division names','serial no']) # custom index creation
# along with the name of the index column.
n_df

                                 city  temperature
Division names  serial no
_weather        0               Dhaka           10
                1            Rajshahi           20
                2             Rangpur           30
Rangpur_weather 0           Gaibandha           40
                1          Lalmonihat           50
                2            Kurigram           50

In [9]:
n_df.loc['Rangpur_weather']

                 city  temperature
serial no
0           Gaibandha           40
1          Lalmonihat           50
2            Kurigram           50

In [10]:
temp=pd.DataFrame({
    'city':['dhk','khl','ctga'],
    'temperature':[30,31,32]
})
temp

   city  temperature
0   dhk           30
1   khl           31
2  ctga           32

In [11]:
wind=pd.DataFrame({
    'city':['dhk','khl','ctga'],
    'windspeed':[5,9,6]
})
wind

   city  windspeed
0   dhk          5
1   khl          9
2  ctga          6

In [12]:
temp1=pd.DataFrame({
    'city':['dhk','khl','ctga'],
    'temperature':[31,35,36]
},index=[1,2,3])
temp1

   city  temperature
1   dhk           31
2   khl           35
3  ctga           36

In [13]:
wind1=pd.DataFrame({
    'city':['khl','dhk','ctga'],
    'windspeed':[5,9,6]
},index=[2,1,3]) # index is manually defined
wind1

   city  windspeed
2   khl          5
1   dhk          9
3  ctga          6

In [14]:
nw_df=pd.concat([temp,wind],axis=0)
nw_df

   city  temperature  windspeed
0   dhk         30.0        NaN
1   khl         31.0        NaN
2  ctga         32.0        NaN
0   dhk          NaN        5.0
1   khl          NaN        9.0
2  ctga          NaN        6.0

In [15]:
nw_df=pd.concat([temp1,wind1],axis=0) # concatinating along axis = 0, columns are adding horizontally
# notice the index number
nw_df

   city  temperature  windspeed
1   dhk         31.0        NaN
2   khl         35.0        NaN
3  ctga         36.0        NaN
2   khl          NaN        5.0
1   dhk          NaN        9.0
3  ctga          NaN        6.0

In [16]:
nw_df=pd.concat([temp,wind],axis=1) # notice we are concatinating according to axis = 1, columns are added side by side
nw_df

   city  temperature  city  windspeed
0   dhk           30   dhk          5
1   khl           31   khl          9
2  ctga           32  ctga          6

In [17]:
n=pd.Series(['rain','snow','sunny'],name='event') # Here "name" is basically the column name.
n

0     rain
1     snow
2    sunny
Name: event, dtype: object

In [18]:
pd.DataFrame(n)

   event
0   rain
1   snow
2  sunny